PANDAS = Python Data Analysis Library

In [72]:
import pandas as pd

Series

In [73]:
rotulos = ['a','b','c']
dados = [1,2,3]

In [74]:
pd.Series(data=dados)

0    1
1    2
2    3
dtype: int64

In [75]:
pd.Series(data=dados,index=rotulos)

a    1
b    2
c    3
dtype: int64

In [76]:
dicionario = {
    'nome':'elene',
    'sobrenome':'ohata'
}

In [77]:
pd.Series(data=dicionario)

nome         elene
sobrenome    ohata
dtype: object

In [78]:
serie = pd.Series(dicionario)

In [79]:
serie

nome         elene
sobrenome    ohata
dtype: object

In [80]:
serie['sobrenome']

'ohata'

In [81]:
dados = [1,2,3,4]
indexes = ['brasil','ager','bol','col']

In [82]:
serie1 = pd.Series(dados,indexes)

In [83]:
serie1

brasil    1
ager      2
bol       3
col       4
dtype: int64

In [84]:
dados2=[3,4,5,6]
indexes = ['brasil','ager','peru','chile']

In [85]:
serie2 = pd.Series(dados2,indexes)

In [86]:
serie2

brasil    3
ager      4
peru      5
chile     6
dtype: int64

In [87]:
serie1+serie2

ager      6.0
bol       NaN
brasil    4.0
chile     NaN
col       NaN
peru      NaN
dtype: float64

# Dataframe

In [88]:
from numpy.random import randn

In [89]:
dados = randn(5,4)
dados

array([[ 0.12733491,  0.16870923,  0.91781333,  2.54726187],
       [-2.46046434,  0.42909403, -1.27392661, -0.4450827 ],
       [-1.49381574, -1.668099  ,  0.473845  , -0.91647127],
       [-0.87548947, -0.72067306,  2.03060286,  0.15439739],
       [ 0.02527911, -0.50340685,  0.54622346,  0.4776987 ]])

In [90]:
indexes = ['a','b','c','d','e']
colunas = ['w','x','y','z']

In [91]:
df = pd.DataFrame(dados,index=indexes,columns=colunas)

In [92]:
df

          w         x         y         z
a  0.127335  0.168709  0.917813  2.547262
b -2.460464  0.429094 -1.273927 -0.445083
c -1.493816 -1.668099  0.473845 -0.916471
d -0.875489 -0.720673  2.030603  0.154397
e  0.025279 -0.503407  0.546223  0.477699

In [93]:
df['w']

a    0.127335
b   -2.460464
c   -1.493816
d   -0.875489
e    0.025279
Name: w, dtype: float64

In [94]:
type(df['w'])

pandas.core.series.Series

In [95]:
df[['w','z']]

          w         z
a  0.127335  2.547262
b -2.460464 -0.445083
c -1.493816 -0.916471
d -0.875489  0.154397
e  0.025279  0.477699

In [96]:
type(df[['w','z']])

pandas.core.frame.DataFrame

In [97]:
colunas_selecionas = ['x','y']
df[colunas_selecionas]

          x         y
a  0.168709  0.917813
b  0.429094 -1.273927
c -1.668099  0.473845
d -0.720673  2.030603
e -0.503407  0.546223

In [98]:
df['nova'] = df['x']+df['y']

In [99]:
df

          w         x         y         z      nova
a  0.127335  0.168709  0.917813  2.547262  1.086523
b -2.460464  0.429094 -1.273927 -0.445083 -0.844833
c -1.493816 -1.668099  0.473845 -0.916471 -1.194254
d -0.875489 -0.720673  2.030603  0.154397  1.309930
e  0.025279 -0.503407  0.546223  0.477699  0.042817

In [100]:
df.drop('nova',axis=1)

          w         x         y         z
a  0.127335  0.168709  0.917813  2.547262
b -2.460464  0.429094 -1.273927 -0.445083
c -1.493816 -1.668099  0.473845 -0.916471
d -0.875489 -0.720673  2.030603  0.154397
e  0.025279 -0.503407  0.546223  0.477699

In [101]:
df

          w         x         y         z      nova
a  0.127335  0.168709  0.917813  2.547262  1.086523
b -2.460464  0.429094 -1.273927 -0.445083 -0.844833
c -1.493816 -1.668099  0.473845 -0.916471 -1.194254
d -0.875489 -0.720673  2.030603  0.154397  1.309930
e  0.025279 -0.503407  0.546223  0.477699  0.042817

In [102]:
df.drop('nova',axis=1,inplace=True)
# df = df.drop('nova',axis=1)

In [103]:
df

          w         x         y         z
a  0.127335  0.168709  0.917813  2.547262
b -2.460464  0.429094 -1.273927 -0.445083
c -1.493816 -1.668099  0.473845 -0.916471
d -0.875489 -0.720673  2.030603  0.154397
e  0.025279 -0.503407  0.546223  0.477699

In [104]:
df.drop('c',inplace=True)

In [105]:
df

          w         x         y         z
a  0.127335  0.168709  0.917813  2.547262
b -2.460464  0.429094 -1.273927 -0.445083
d -0.875489 -0.720673  2.030603  0.154397
e  0.025279 -0.503407  0.546223  0.477699

In [106]:
df.loc['b']

w   -2.460464
x    0.429094
y   -1.273927
z   -0.445083
Name: b, dtype: float64

In [107]:
df.iloc[1]

w   -2.460464
x    0.429094
y   -1.273927
z   -0.445083
Name: b, dtype: float64

In [108]:
df.loc['b','w']

-2.460464339864219

In [109]:
df.loc[['d','e'],['y','z']]

          y         z
d  2.030603  0.154397
e  0.546223  0.477699

In [110]:
df

          w         x         y         z
a  0.127335  0.168709  0.917813  2.547262
b -2.460464  0.429094 -1.273927 -0.445083
d -0.875489 -0.720673  2.030603  0.154397
e  0.025279 -0.503407  0.546223  0.477699

In [111]:
df>0

       w      x      y      z
a   True   True   True   True
b  False   True  False  False
d  False  False   True   True
e   True  False   True   True

In [112]:
df[df>0]

          w         x         y         z
a  0.127335  0.168709  0.917813  2.547262
b       NaN  0.429094       NaN       NaN
d       NaN       NaN  2.030603  0.154397
e  0.025279       NaN  0.546223  0.477699

In [113]:
df[df['w']>0]

          w         x         y         z
a  0.127335  0.168709  0.917813  2.547262
e  0.025279 -0.503407  0.546223  0.477699

In [114]:
df[df['w']>0]['y']

a    0.917813
e    0.546223
Name: y, dtype: float64

In [115]:
df[(df['w']>0) & (df['y']<1)]

          w         x         y         z
a  0.127335  0.168709  0.917813  2.547262
e  0.025279 -0.503407  0.546223  0.477699

In [116]:
import numpy as np

In [127]:
dicionario = {
    'a':[1,2,np.nan,10],
    'b':[3,np.nan,np.nan,10],
    'c':[4,5,6,20],
}

In [128]:
df = pd.DataFrame(dicionario)
df

      a     b   c
0   1.0   3.0   4
1   2.0   NaN   5
2   NaN   NaN   6
3  10.0  10.0  20

In [129]:
df.dropna()

      a     b   c
0   1.0   3.0   4
3  10.0  10.0  20

In [130]:
df.dropna(axis=1)

    c
0   4
1   5
2   6
3  20

In [131]:
# df.dropna(inplace=True)
# df

In [132]:
df.fillna(value=0)

      a     b   c
0   1.0   3.0   4
1   2.0   0.0   5
2   0.0   0.0   6
3  10.0  10.0  20

In [133]:
df_csv = pd.read_csv('example.csv')

In [134]:
df_csv

   col1  col2  col3
0     1     2     3
1     4     5     6
2     7     8     9

In [136]:
df_csv['nova']=df_csv['col1']+df_csv['col3']
df_csv

   col1  col2  col3  nova
0     1     2     3     4
1     4     5     6    10
2     7     8     9    16

In [137]:
df.to_csv('novo_csv.csv')

comma separated values

In [146]:
df_csv2 = pd.read_csv('example2.csv',sep=';')
df_csv2

   col1  col2  col3
0     1     2     3
1     4     5     6
2     7     8     9

In [160]:
df = pd.read_csv('example.csv')
df

   col1  col2  col3 genero
0     1     2     3      f
1     4     2     6      m
2     7     8     3      f
3     1     5     9      m
4     2     4     7      f
5     2     3     7      f

In [161]:
df.head(4)

   col1  col2  col3 genero
0     1     2     3      f
1     4     2     6      m
2     7     8     3      f
3     1     5     9      m

In [162]:
df.tail()

   col1  col2  col3 genero
1     4     2     6      m
2     7     8     3      f
3     1     5     9      m
4     2     4     7      f
5     2     3     7      f

In [163]:
df['genero'].unique()

array(['f', 'm'], dtype=object)

In [164]:
len(df['genero'].unique())

2

In [165]:
df['genero'].nunique()

2

In [166]:
df['genero'].value_counts()

f    4
m    2
Name: genero, dtype: int64

In [168]:
df.columns

Index(['col1', 'col2', 'col3', 'genero'], dtype='object')

In [170]:
def multiplica_por_2(x):
    return x*2

In [171]:
df['mult2']=df['col1'].apply(multiplica_por_2)

In [172]:
df

   col1  col2  col3 genero  mult2
0     1     2     3      f      2
1     4     2     6      m      8
2     7     8     3      f     14
3     1     5     9      m      2
4     2     4     7      f      4
5     2     3     7      f      4